{
    "powermodule" : {
        "title": "Power Module",
        "description": [
            "<h3>Overview</h3>",
            "The Power Module consists of 4 channels, all with 6A maximum current output at different voltages: 1V8, 2V5; 3V3; 5V; To achieve this it uses the TPS62180.<br><br>",
            "The module is protected with the TPS25970, that has overcurrent, overvoltage and undervoltage features. <br><br>",
            "To connect to other boards and provide power, it uses a low profile connector, 2074190081. The power can be also supplied using a bigger connector mounted on the top.<br><br>"
        ],
        "pictures" : [
            ["../pics/powermodule/powermoduletop.png", "../pics/powermodule/powermoduletop.png", "../pics/powermodule/powermoduletop.webp", "Top PCB"],
            ["../pics/powermodule/powermodulebottom.png", "../pics/powermodule/powermodulebottom.png", "../pics/powermodule/powermodulebottom.webp", "Bottom PCB"],
            ["../pics/powermodule/blockdiagram.png", "../pics/powermodule/blockdiagram.png", "../pics/powermodule/blockdiagram.webp", "Block Diagram"],
            ["../pics/powermodule/1.png", "../pics/powermodule/1.png", "../pics/powermodule/1.webp", "Top Layer"],
            ["../pics/powermodule/2.png", "../pics/powermodule/2.png", "../pics/powermodule/2.webp", "GND Layer"],
            ["../pics/powermodule/3.png", "../pics/powermodule/3.png", "../pics/powermodule/3.webp", "Power Layer"],
            ["../pics/powermodule/4.png", "../pics/powermodule/4.png", "../pics/powermodule/4.webp", "Bottom Layer"],
            ["../pics/powermodule/006.png", "../pics/powermodule/006.png", "../pics/powermodule/006.webp", "Power Analysis"],
            ["../pics/powermodule/007.png", "../pics/powermodule/007.png", "../pics/powermodule/007.webp", "Power Analysis"]
        ],
        "thumbnail": [
            "PowerModuleTop.png", "PowerModuleTop.webp"
        ],
        "medium": "",
        "git": "https://github.com/silardg/PowerModule"
    },
    "hub" : {
        "title": "Project Hub",
        "description": [
            "<h3>Overview</h3>",
            "This project is an automotive oriented hub. It has an upstream USB-C with USB 3.2 Gen 2 characteristics coupled with a hub chip that outputs various GPIO functionality, from which UART is used for RS485, alongside two USB 2.0 and one USB 3.2 Gen 2 connectors.<br><br>",
            "It also houses a 10/100/1000 ethernet that works off of a USB to Ethernet converter IC.<br><br>",
            "The power input is 10-24V, which is regulated down to 5V/1.2V/3.3V.<br><br>",
            "The board uses a 6 layer stackup from Aisler."
        ],
        "pictures" : [
            ["../pics/hub/TopHub.png", "../pics/hub/0.png", "../pics/hub/0.webp", "Top PCB"],
            ["../pics/hub/BottomHub.png", "../pics/hub/1.png", "../pics/hub/1.webp", "Bottom PCB"]
        ],
        "thumbnail": [
            "hub.png", "hub.webp"
        ],
        "medium": "",
        "git": ""
    },
    "crypto" : {
        "title": "Project Crypto",
        "description": [
            "<h3>Overview</h3>",
            "The project crypto is a dev kit I designed for a client that will be used to evaluate their idea and create an MVP.<br><br>",
            "Its main purpose is to develop the firmware for the Microchip MCU used. Peripherals include USB-C, cryptography IC, NFC with custom antenna and an RGB LED array.<br><br>",
            "The board was designed using Altium Designer and manufactured with the help of Aisler and their assembly line.<br><br>",
            "The whole project from start to finish was done within 2 weeks, not including Aislers time to manufacture.<br><br>",
            "Next to designing the hardware (schematic and pcb), I'm also consulting the client with future plans and converting the MVP to a full product.<br><br>"
        ],
        "pictures" : [
            ["../pics/crypto/Top.png", "../pics/crypto/0.png", "../pics/crypto/0.webp", "Top View"],
            ["../pics/crypto/Bottom.png", "../pics/crypto/1.png", "../pics/crypto/1.webp", "Top View"]
        ],
        "thumbnail": [
            "crypto.png", "crypto.webp"
        ],
        "medium": "https://medium.com/@silardg/from-concept-to-mvp-in-just-2-weeks-the-success-story-of-project-crypto-ccacb18f3e4a",
        "git": ""
    },
    "module" : {
        "title": "ESP Module",
        "description": [
            "<h3>Overview</h3>",
            "The ESP Module is a personal project, which is a standard ESP module on steroids.<br><br>",
            "Next to an ESP32-S3, it has a 16 Channel IO Expander, External flash, Ceramic antenna and an 8 Channel ADC Expander.<br><br>",
            "All this is packed inside a 36mm x 22mm, one sided PCB.<br><br>",
            "It uses QFN and 0201 parts.<br><br>"
        ],
        "pictures" : [
            ["../pics/module/ESPModuleTop.png", "../pics/module/0.png", "../pics/module/0.webp", "Top View"],
            ["../pics/module/ESPModuleBottom.png", "../pics/module/1.png", "../pics/module/1.webp", "Bottom View"]
        ],
        "thumbnail": [
            "module.png", "module.webp"
        ],
        "medium": "https://medium.com/@silardg/an-esp-module-on-steroids-9e405c656071",
        "git": ""
    },
    "cube" : {
        "title": "Project Cube",
        "description": [
            "<h3>Overview</h3>",
            "Consisting of three individual boards, each with a specific function, the CUBE project's components are connected using high-speed connectors, alongside a battery and casing. When fully assembled, the product measures a compact three cubic centimeters.<br><br>",
            "The first board, situated at the bottom, is the power board, featuring a USB-C connector for battery charging and communication to the main chip, along with a 3.3V buck regulator, Li-Po charger, and a BGA-packaged fuel gauge. Temperature sensors on the board's underside monitor battery temperature, presenting power design and BGA package usage.<br><br>",
            "The second board, located in the middle, houses an ESP32-S2 with an antenna for WiFi and Bluetooth capabilities, showcasing proper MCU placement and routing with double-sided assembly practices.<br><br>",
            "The third board, positioned on top, is the sensor board, equipped with RGB LEDs, temperature/humidity, accelerometer/gyroscope sensors, and a ToF sensor, demonstrating proper I2C communication standards and isolating critical sensors like the temperature/humidity sensor.<br><br>",
            "The casing is simplistic and features cutouts at the connectors and buttons.<br><br>",
            "This project was completed using Altium Designer, with FreeCAD utilized for the casing. The Altium Designer multiboard feature was used to ensure that all boards align perfectly.<br><br>"
        ],
        "pictures" : [
            ["../pics/cube/0.png", "../pics/cube/0.png", "../pics/cube/0.webp", "Full Product"],
            ["../pics/cube/1.png", "../pics/cube/1.png", "../pics/cube/1.webp", "Power PCB Top"],
            ["../pics/cube/2.png", "../pics/cube/2.png", "../pics/cube/2.webp", "Power PCB Bottom"],
            ["../pics/cube/3.png", "../pics/cube/3.png", "../pics/cube/3.webp", "MCU PCB Top"],
            ["../pics/cube/4.png", "../pics/cube/4.png", "../pics/cube/4.webp", "MCU PCB Bottom"],
            ["../pics/cube/5.png", "../pics/cube/5.png", "../pics/cube/5.webp", "Sensor PCB Top"],
            ["../pics/cube/6.png", "../pics/cube/6.png", "../pics/cube/6.webp", "Sensor PCB Bottom"]
        ],
        "thumbnail": [
            "cube.png", "cube.webp"
        ],
        "medium": "",
        "git": "https://github.com/silardg/CUBE"
    },
    "robots" : {
        "title": "Robotics - Elektropioneer",
        "description": [
            "<h3>Overview</h3>",
            "Robotics has been a passion of mine since I started working with electronics and programming. I was fortunate enough to be a part of Elektropioneer, my robotics team, for six years: four as a member and two as a mentor. Our team's primary goal was to participate in the Eurobot competition, where we were the only high school team competing against colleges.<br><br>",
            "Throughout my time on the team, I was exposed to and worked on every aspect of the robot, including electronics, software, mechanical, and tactical. As I progressed, I became the leader for the electronics and firmware side of the robot. Our team primarily used Atmel and PIC-based MCUs that communicated with each other through CAN Bus.<br><br>",
            "We divided the robots into multiple parts, including the main board, actuator board, sensor board, and odometry board. The main board acted as the brains of the robot and issued commands to every module through CAN Bus. The actuator board housed relays, MOSFETs, stepper drivers, and DC motor drivers to control every actuator the robot had. The sensor board was optocoupler-based and converted our 12V sensor signals to the appropriate voltages. The odometry board was the most complex, as it had to read the encoders and determine the speed of the motors. It also housed all the software that made the robot move on the table, including PID control.<br><br>",
            "Every year, we rebuilt the electronics, software, and mechanical aspects of the robot to comply with the new competition rules.<br><br>",
            "Aside from the technical aspect of robotics, I also learned a lot about working in a team and managing a small group of people.<br><br>"
        ],
        "pictures" : [
            ["../pics/robot/0.png", "../pics/robot/0.png", "../pics/robot/0.png", "The Eurobot competition"],
            ["../pics/robot/1.png", "../pics/robot/1.png", "../pics/robot/1.webp", "3D CAD Model of the robot"],
            ["../pics/robot/3.png", "../pics/robot/3.png", "../pics/robot/3.png", "View of the three robots"],
            ["../pics/robot/4.png", "../pics/robot/4.png", "../pics/robot/4.webp", "Top view of the robot"],
            ["../pics/robot/5.png", "../pics/robot/5.png", "../pics/robot/5.webp", "Front view of the robot"],
            ["../pics/robot/6.png", "../pics/robot/6.png", "../pics/robot/6.webp", "Side view of the robot"],
            ["../pics/robot/7.png", "../pics/robot/7.png", "../pics/robot/7.webp", "Main board"],
            ["../pics/robot/8.png", "../pics/robot/8.png", "../pics/robot/8.webp", "Optocoupler board"],
            ["../pics/robot/9.png", "../pics/robot/9.png", "../pics/robot/9.webp", "Older AT90CAN128 Main board"],
            ["../pics/robot/10.png", "../pics/robot/10.png", "../pics/robot/10.webp", "Motor controller"],
            ["../pics/robot/2.png", "../pics/robot/2.png", "../pics/robot/2.webp", "Lidar board"],
            ["https://github.com/Elektropioneer", "../pics/robot/11.png", "../pics/robot/11.webp", "Firmware"]
        ],
        "thumbnail": [
            "robot2.png", "robot2.webp"
        ],
        "medium": "",
        "git": "https://github.com/elektropioneer"
    },
    "plc" : {
        "title": "PLC - Fortis",
        "description": [
            "<h3>Overview</h3>",
            "The Fortis project was an innovative solution developed internally at SENSA to enter the PLC market with a cost-effective and compact design.<br>",
            "This board boasted 8 inputs and 8 outputs, utilizing CAN Bus as an extension network, along with Ethernet, USB, and Bluetooth connectivity options. Powered by an STM32F103C8T6 microcontroller, this board was compatible with standard DIN rail casings, making it easy to integrate into existing systems.<br><br>", 
            "<h3>Firmware</h3>",
            "The firmware written for this application was done using C and FreeRTOS. The USB connectivity to the PC host was first developed to connect to a custom Application.<br><br><br>"
        ],
        "pictures" : [
            ["../pics/plc/1.png", "../pics/plc/1.png", "../pics/plc/1.webp", "Top PCB"],
            ["../pics/plc/0.png", "../pics/plc/0.png", "../pics/plc/0.webp", "Bottom PCB"]
        ],
        "thumbnail": [
            "plc.png", "plc.webp"
        ],
        "medium": "",
        "git": ""
    },
    "heater" : {
        "title": "Heating Controller",
        "description": [
            "<h3>Overview</h3>",
            "At SENSA, I worked on the development of the heating controller, a project aimed at controlling a patented heating element with specialized features. The primary focus of the project was to ensure its robustness and provide efficient control for the heating system.<br><br>",
            "The controller board was equipped with relays, external display with an encoder, multiple switch inputs, AC motor control using PWM, DC motor control, and weight scale reading capabilities.<br><br>",
            "To achieve the desired robustness, we developed several iterations of the board, testing with newer Atmel chips until we found the most effective solution.<br><br>"
        ],
        "pictures" : [
            ["../pics/heat/heat.png", "../pics/heat/heat.png", "../pics/heat/heat.webp", "PCB v1.0"]
        ],
        "thumbnail": [
            "heat.png", "heat.webp"
        ],
        "medium": "",
        "git": ""
    },
    "led" : {
        "title": "LED Controller",
        "description": [
            "<h3>Overview</h3>",
            "I worked on an exciting lighting project for a Canadian client, providing a complete electronics solution. The project aimed to meet certification standards, incorporate wireless connectivity, and control special LEDs.<br><br>",
            "Obtaining certification for the board was a smooth process. However, developing the firmware posed some challenges. It required the creation of a LED animation driver and the implementation of an MQTT-based protocol for control. Additionally, I took charge of developing the iOS and Android applications to complement the firmware. It was an engaging experience working on both the firmware and the applications, ensuring a comprehensive solution for the project.<br><br>"
        ],
        "pictures" : [
            ["../pics/led/0.png", "../pics/led/0.png", "../pics/led/0.webp", "Product in case"],
            ["../pics/led/1.png", "../pics/led/1.png", "../pics/led/1.webp", "PCB"]
        ],
        "thumbnail": [
            "led.png", "led.webp"
        ],
        "medium": "",
        "git": ""
    },
    "watercontroller" : {
        "title": "Water Controller",
        "description": [
            "<h3>Overview</h3>",
            "The water controller project was commissioned by an American client, who ultimately had <b>50,000</b> units manufactured. The device was designed to control a valve while consuming minimal power.<br><br>",
            "The board incorporated an ATTiny MCU and was powered by a 9V battery with custom connectors. To alert users when the battery was running low, the board also included voltage monitoring functionality.<br><br>",
            "The project went through three iterations, with the final version being the most cost-effective. This version replaced the original MCU with a 9-cent MCU, saving almost $1 per unit.<br><br>",
            "<h3>Firmware</h3>",
            "There were two versions of the firmware. The first version was designed for the ATTiny. Its main function was to control the valve and monitor the inputs. At the end of each cycle, it would power it self off.<br><br>",
            "The second version was just ported to the 9-cent MCU, which worked in the same way."
        ],
        "pictures" : [
            ["../pics/toilet/0.png", "../pics/toilet/0.png", "../pics/toilet/0.webp", "PCB populated"],
            ["../pics/toilet/2.png", "../pics/toilet/2.png", "../pics/toilet/2.webp", "PCB"],
            ["../pics/toilet/1.png", "../pics/toilet/1.png", "../pics/toilet/1.webp", "Group of boards"]
            
        ],
        "thumbnail": [
            "toilet.png", "toilet.webp"
        ],
        "medium": "",
        "git": ""
    },
    "qt" : {
        "title": "Qt Examples and Weather Station",
        "description": [
            "<h3>Overview</h3>",
            "I have been doing testing and learning Qt's functionality. Starter, Layout and addressBook are projects that I did to test the functionality, thus trying out examples.<br><br>",
            "<h3>Temperature part</h3>",
            "The temperature project focuses on combining Qt and an MCU with a sensor. I'm using Qt as a dashboard platform to show the sensor read values. The MCU used is an ESP32 with an AM2302 temperature/humidity sensor.<br><br>"
        ],
        "pictures" : [],
        "thumbnail": [
            "qt.png", "qt.webp"
        ],
        "medium": "",
        "git": "https://github.com/silardg/QtTest"
    },
    "misc" : {
        "title": "Miscellaneous Projects",
        "description": [
            "<h3>Overview</h3>",
            "This section groups all smaller projects and other software projects that I have done.<br><br>",
            "<h3>Boxing Robot</h3>",
            "The boxing robot was an exciting project for a UK-based client, though the robot itself cannot be shown due to confidentiality. My role in the project was to design the hardware and software necessary to control the robot's 4 stepper motors.<br><br>",
            "The first board was mounted alongside an encoder and stepper driver onto the motor, serving as an interface to control each stepper. It utilized an ATMEGA328P microcontroller with connectors to the main board, encoder, and driver, and included PID control for precise positioning of the stepper motors. The main board sent commands to the first board on where the stepper motor should go, which was then used to calculate the rotation angle of the stepper motor with PID controlling.<br><br>",
            "The second board was the master board, utilizing an Arduino MEGA as a shield, which communicated with the motors and controlled various actuators and high-power LEDs. Additionally, it was equipped with accelerometers to measure punches thrown at the robot. It was also connected to a PC, which ran a control panel software designed to send specific boxing combinations to the robot.<br><br>",
            "The hardware was designed using KiCAD, and the software for the PC was written with Qt.<br><br>",
            "<h3>Parking sensor</h3>",
            "",
            "<h3>Retail Display</h3>",
            "",
            "<h3>Power supply</h3>",
            "",
            "<h3>Athletic device</h3>",
            ""
        ],
        "pictures" : [
            ["../pics/misc/box0.png", "../pics/misc/box0.png", "../pics/misc/box0.webp", "Boxing Robot Stepper Controller"],
            ["../pics/misc/box1.png", "../pics/misc/box1.png", "../pics/misc/box1.webp", "Boxing Robot Main Controller"],
            ["../pics/misc/box2.png", "../pics/misc/box2.png", "../pics/misc/box2.webp", "Boxing Robot Motors"],

            ["../pics/misc/parking0.png", "../pics/misc/parking0.png", "../pics/misc/parking0.webp", "Parking sensor Populated"],
            ["../pics/misc/parking1.png", "../pics/misc/parking1.png", "../pics/misc/parking1.webp", "Parking sensor back"],
            ["../pics/misc/parking2.png", "../pics/misc/parking2.png", "../pics/misc/parking2.webp", "Parking sensor front"],

            ["../pics/misc/retail0.png", "../pics/misc/retail0.png", "../pics/misc/retail0.webp", "Retail display front"],
            ["../pics/misc/retail1.png", "../pics/misc/retail1.png", "../pics/misc/retail1.webp", "Retail display back"],
            ["../pics/misc/retail2.png", "../pics/misc/retail2.png", "../pics/misc/retail2.webp", "Retail display in casing"],

            ["../pics/misc/power0.png", "../pics/misc/power0.png", "../pics/misc/power0.webp", "Power supply"],
            ["../pics/misc/power1.png", "../pics/misc/power1.png", "../pics/misc/power1.webp", "Power supply"],

            ["../pics/misc/athlete.png", "../pics/misc/athlete.png", "../pics/misc/athlete.webp", "Athletic device"]
        ],
        "thumbnail": [
            "misc.png", "misc.webp"
        ],
        "medium": "",
        "git": ""
    }
}